In [1]:
# 10 - Operations on Data Frames

In [2]:
# a - merging / concatenating Data Frames

In [3]:
# in order to concatenate 2 dataframes
# the size and columns of two data frames must be same

In [6]:
import pandas as pd
import numpy as np

In [8]:
df1 = pd.DataFrame(np.random.randint(30,size=(4,4)),index=list('ijkl'),columns=list('ABCD'))
df2 = pd.DataFrame(np.random.randint(10,size=(4,4)),index=list('mnop'),columns=list("ABCD"))

In [9]:
df1.head()

    A   B   C   D
i  12  24  16  10
j  18  14  28  23
k   2  19  16   9
l  14  28  18  11

In [10]:
df2.head()

   A  B  C  D
m  3  8  6  9
n  1  6  2  7
o  6  7  9  5
p  5  6  8  5

In [12]:
pd.concat([df1,df2])

    A   B   C   D
i  12  24  16  10
j  18  14  28  23
k   2  19  16   9
l  14  28  18  11
m   3   8   6   9
n   1   6   2   7
o   6   7   9   5
p   5   6   8   5

In [ ]:
`

In [13]:
# b - Transpose a Data set or dataframe using Pandas

In [14]:
df1_transpose = df1.T

In [15]:
df1_transpose.head()

    i   j   k   l
A  12  18   2  14
B  24  14  19  28
C  16  28  16  18
D  10  23   9  11

In [16]:
# c - To sort a Pandas DataFrame

In [18]:
df1.sort_values(by='A')

    A   B   C   D
k   2  19  16   9
i  12  24  16  10
l  14  28  18  11
j  18  14  28  23

In [19]:
df2.sort_values(by=['A','C'],ascending=False)

   A  B  C  D
o  6  7  9  5
p  5  6  8  5
m  3  8  6  9
n  1  6  2  7

In [21]:
# you can sort only wrt columns and in asceding / descending order

In [22]:
# d-Remove Duplicate values of a variable in a Pandas DF

In [27]:
df3 = pd.DataFrame(np.random.randint(100,size=(10,5)),index=range(10),columns=list('ABCDE'))

In [28]:
df3.head()

    A   B   C   D   E
0  80  91  16  58  60
1  87  46  12  65  23
2  68  23  74  65  36
3   5  53  85  90  93
4  15  15   7  48  65

In [29]:
df3.shape

(10, 5)

In [35]:
df3.drop_duplicates(subset='D').shape

(8, 5)

In [40]:
df3.drop_duplicates(subset='E').shape

(9, 5)

In [41]:
df3.drop_duplicates(subset='D')

    A   B   C   D   E
0  80  91  16  58  60
1  87  46  12  65  23
3   5  53  85  90  93
4  15  15   7  48  65
5  20   9  79  37  87
6   1   1  67  78  20
8  34  28  53  99  60
9   6  27  97  93  69